namespace LEARNING_CONCEPTS
{
	// **************************************************
	//public class Son : Father
	//{
	//	public Son() : base()
	//	{
	//	}
	//}
	// **************************************************

	// **************************************************
	//public class Son : Father
	//{
	//	public Son() : base()
	//	{
	//	}

	//	/// <summary>
	//	/// من دیگه نمی‌خوام کار پدرم رو انجام بدم
	//	/// </summary>
	//	public override void Work()
	//	{
	//		// می‌خوام همان کار پدرم رو انجام بدم
	//		base.Work();
	//	}
	//}
	// **************************************************

	// **************************************************
	//public class Son : Father
	//{
	//	public Son() : base()
	//	{
	//	}

	//	/// <summary>
	//	/// من دیگه نمی‌خوام کار پدرم رو انجام بدم
	//	/// </summary>
	//	public override void Work()
	//	{
	//		// می‌خوام همان کار پدرم رو انجام بدم
	//		base.Work();

	//		System.Windows.Forms.MessageBox.Show("از ساعت چهار بعد از ظهر تا هشت شب مسافرکشی می‌کنم");
	//	}
	//}
	// **************************************************

	// **************************************************
	//public class Son : Father
	//{
	//	public Son() : base()
	//	{
	//	}

	//	/// <summary>
	//	/// من دیگه نمی‌خوام کار پدرم رو انجام بدم
	//	/// </summary>
	//	public override void Work()
	//	{
	//		System.Windows.Forms.MessageBox.Show("از ساعت شش صبح تا هشت صبح مسافرکشی می‌کنم");

	//		// می‌خوام همان کار پدرم رو انجام بدم
	//		base.Work();
	//	}
	//}
	// **************************************************

	// **************************************************
	//public class Son : Father
	//{
	//	public Son() : base()
	//	{
	//	}

	//	/// <summary>
	//	/// من دیگه نمی‌خوام کار پدرم رو انجام بدم
	//	/// </summary>
	//	public override void Work()
	//	{
	//		System.Windows.Forms.MessageBox.Show("از ساعت شش صبح تا هشت صبح مسافرکشی می‌کنم");

	//		// می‌خوام همان کار پدرم رو انجام بدم
	//		base.Work();

	//		System.Windows.Forms.MessageBox.Show("از ساعت چهار بعد از ظهر تا هشت شب مسافرکشی می‌کنم");
	//	}
	//}
	// **************************************************

	// **************************************************
	public class Son : Father
	{
		public Son() : base()
		{
		}

		/// <summary>
		/// من دیگه نمی‌خوام کار پدرم رو انجام بدم
		/// </summary>
		public override void Work()
		{
			System.Windows.Forms.MessageBox.Show("از ساعت شش صبح تا هشت شب مسافرکشی می‌کنم");
		}
	}
	// **************************************************
}
